{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_a_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_a_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1_a", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_a_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_a_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_a_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_a_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_a_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_a_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1_b", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[0, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_b_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_b_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_2_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "8", 
        "pad": "(2, 2)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_2_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "8", 
        "pad": "(2, 2)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1_b_2", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "8", 
        "pad": "(2, 2)", 
        "stride": "[]"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_b_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_b_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_b_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1_c", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[0, 0, 0], [28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_c_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_c_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1_c_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "8", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_c_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_c_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[39, 0, 0], [40, 0, 0], [41, 0, 0], [42, 0, 1], [43, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_c_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_1_d", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_d_2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_d_2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1_d_2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "8", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_d_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_d_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_d_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_d_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_d_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0], [52, 0, 1], [53, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_d_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {"num_args": "4"}, 
      "inputs": [[9, 0, 0], [27, 0, 0], [45, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_1_concat_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[60, 0, 0], [61, 0, 0], [62, 0, 0], [63, 0, 1], [64, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_2_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3_2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 1], [83, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_3_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[88, 0, 0], [89, 0, 0], [90, 0, 0], [91, 0, 1], [92, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_3_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_4_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_4_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4_2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_4_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[107, 0, 0], [108, 0, 0], [109, 0, 0], [110, 0, 1], [111, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_4_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "128", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_4_3_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[116, 0, 0], [117, 0, 0], [118, 0, 0], [119, 0, 1], [120, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_4_3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_5_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_5_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_5", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "10"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_5_pooling", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    15, 
    16, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    40, 
    41, 
    42, 
    43, 
    47, 
    48, 
    50, 
    51, 
    52, 
    53, 
    58, 
    59, 
    61, 
    62, 
    63, 
    64, 
    68, 
    69, 
    71, 
    72, 
    73, 
    74, 
    77, 
    78, 
    80, 
    81, 
    82, 
    83, 
    86, 
    87, 
    89, 
    90, 
    91, 
    92, 
    96, 
    97, 
    99, 
    100, 
    101, 
    102, 
    105, 
    106, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    117, 
    118, 
    119, 
    120, 
    124, 
    125, 
    129
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157
  ], 
  "heads": [[130, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}