{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_1", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_1_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_1_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_1_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_1_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 1], [17, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_2_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_pre_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_pre_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3_pre", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_pre_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_pre_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_pre_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_pre_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_pre_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0], [26, 0, 1], [27, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_pre_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0], [35, 0, 1], [36, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3_2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 1], [45, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_3_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_3_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_3_3_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_3_3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[56, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_3_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_pre_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_pre_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4_pre", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "64"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_4_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[64, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 1], [68, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_4_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4_2", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "[]", 
        "stride": "[]"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_2_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_4_2_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 1], [77, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_4_2_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bias", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_4_3", 
      "attrs": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "[]"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_gamma", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_beta", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_4_3_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "False"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "Conv_4_3_bn", 
      "attrs": {"fix_gamma": "False"}, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "Conv_4_3_act", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[88, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_4_pooling", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "Conv_5_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "Conv_5_bias", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "Conv_5", 
      "attrs": {
        "kernel": "(1, 1)", 
        "num_filter": "10"
      }, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "Conv_5_pooling", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    11, 
    12, 
    14, 
    15, 
    16, 
    17, 
    21, 
    22, 
    24, 
    25, 
    26, 
    27, 
    30, 
    31, 
    33, 
    34, 
    35, 
    36, 
    39, 
    40, 
    42, 
    43, 
    44, 
    45, 
    48, 
    49, 
    51, 
    52, 
    53, 
    54, 
    59, 
    60, 
    62, 
    63, 
    65, 
    66, 
    67, 
    68, 
    71, 
    72, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    83, 
    84, 
    85, 
    86, 
    91, 
    92, 
    96
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116
  ], 
  "heads": [[97, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10300]}
}